### Introduction to Pandas

<ul>
    <li>Pandas is open source library built on top of NumPy.</li>
    <li>It allows for fast analysis and data cleaning and preparation.</li>
    <li>Features performance and productivity.</li>
    <li>Built-in visualisation features.</li>
    <li>It can work with data from a wide variety of sources.</li>
</ul>

#### SERIES

Similar to a numpy-array.<br>
Differentiates by access labels i.e it can be indexed by a label.

In [1]:
import numpy as np
import pandas as pd

In [9]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30 }

In [10]:
 pd.Series(data=my_data) # SHIFT-TAB HERE
#LABEL INDEX AND DATAPOINTS

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(data=my_data,index=labels)
# CALL THESE DATAPOINTS USING THESE LABELLED INDEXES

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [13]:
# IN CASE OF DICTIONARY IT WILL AUTOMATICALLY GRAB INDEX 
# AND VALUES

In [14]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [15]:
# Can hold a variety of data objects
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [16]:
print(pd.Series([sum,print,len]))
print(pd.Series([sum,print,len])[0](my_data))

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object
60

The key to using a series is understanding its index in Pandas<br>
makes use of these index names or numbers by allowing for very fast<br>
lookups of info, and it works just like a hash table or dictionary.<br>

In [17]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
print(ser1)

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [18]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
print(ser2)

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [19]:
ser1['USA']

1

In [20]:
ser1[3]

4

In [21]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

#### DATA-FRAMES

In [36]:
import numpy as np
import pandas as pd

In [37]:
from numpy.random import randn

In [38]:
np.random.seed(101)
# RESULTS IN THE SAME RANDOM NUMBERS AS THE TUTORIAL FOR THE 
# FIRST TIME

In [25]:
test = [4,87829388,'Vijay',428,'France','Male',24,3,0,1,0,0,65124.8]
np.array(test).shape

(13,)

In [26]:
csvdat=["RowNumber","CustomerId","Surname","CreditScore","Geography","Gender","Age","Tenure","Balance","NumOfProducts","HasCrCard","IsActiveMember","EstimatedSalary"]
len(csvdat)

13

In [27]:
dataf = pd.DataFrame(np.array(test).reshape(1,13),columns = csvdat)
dataf

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,4,87829388,Vijay,428,France,Male,24,3,0,1,0,0,65124.8

In [45]:
# DATAFRAME         DATA          INDEX                   COLUMNS
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [46]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [30]:
df['W']  # EACH COLUMN IS A SERIES

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [31]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [32]:
print(type(df))
print(type(df['W']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

DataFrame is bunch of series that share the same index

In [33]:
df[['W','Z']] # multiple columns in list

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

To insert a new column , we can use a dictionary type declaration. <br>
new values are 'assigned directly' to the new column.

In [34]:
df['New'] = df['W'] + df['Y']
# both PANDAS series are added corresponding to their indexes
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [35]:
df.drop('New')

KeyError: "labels ['New'] not contained in axis"

In [36]:
df.drop('New',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df # NO CHAMGE UNLESS INPLACE PARAMETER IS DECLARED

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [38]:
print(df.drop(labels=['C','D']))
print(df.drop('D',axis=0))

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
E  0.190794  1.978757  2.605967  0.683509  2.796762
          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [39]:
df.drop('New',axis=1,inplace=True)

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df.shape # ROWS referred to 0 axis COLUMNS referred to 1 axis 
         # on basis of index

(5, 4)

To extract rows

In [42]:
df.loc['A':'C'] ## SEE DOCSTRING FOR EACH AND EVERYTHING

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

This shows that not only the columns are pandas Series , but the rows aswell.

In [43]:
df.loc

In [44]:
df.iloc[2]  # NUMERICAL BASED

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [45]:
df.loc['B','Y']

-0.8480769834036315

In [46]:
df.loc['B']['Y'] #SIMILAR TO NUMPY

-0.8480769834036315

In [47]:
df.loc[['B','C'],['Y','W']]

          Y         W
B -0.848077  0.651118
C  0.528813 -2.018168

### Conditional selection

If we perform selection on entire dataFrame, results in null values.<br>
If we apply to a column and then extract the rows , it will show only<br>
those rows which satisfy the column condition.

In [8]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [9]:
booldf = df >0

In [10]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [11]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

OR

In [12]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df['W']
# IT RETURNS A SERIES OF COLUMN W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
df['W']>0  # CHECKS FOR EACH VALUE OF SERIES ACCORDING TO COND'n

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [15]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
## GRAB ALL THE ROWS WHERE Z < 0

In [16]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [17]:
df['Z'] < 0

A    False
B    False
C     True
D    False
E    False
Name: Z, dtype: bool

In [18]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [19]:
df[df['W']>0].loc['A','X']

0.6281327087844596

In [20]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

### Multiple conditions

In [21]:
# PASS INSIDE dataFrame's selection , the conditions separated by
# & (and) , | (or)
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Index in dataframes

In [47]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [48]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

To reset the index back to defaut - numerical.<br>
We use reset_index ( does not change original).<br>
The index becomes a column of the dataFrame.

In [49]:
new = df.copy()
new

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [50]:
new.reset_index(inplace = True)
new

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [51]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [52]:
state = 'CA NY WY OR CO'.split()

In [53]:
df["State"] = state
df

          W         X         Y         Z State
A  0.302665  1.693723 -1.706086 -1.159119    CA
B -0.134841  0.390528  0.166905  0.184502    NY
C  0.807706  0.072960  0.638787  0.329646    WY
D -0.497104 -0.754070 -0.943406  0.484752    OR
E -0.116773  1.901755  0.238127  1.996652    CO

In [54]:
df.set_index("State")

              W         X         Y         Z
State
CA     0.302665  1.693723 -1.706086 -1.159119
NY    -0.134841  0.390528  0.166905  0.184502
WY     0.807706  0.072960  0.638787  0.329646
OR    -0.497104 -0.754070 -0.943406  0.484752
CO    -0.116773  1.901755  0.238127  1.996652

This will overwrite the previous index of the dataframe.

In [55]:
df

          W         X         Y         Z State
A  0.302665  1.693723 -1.706086 -1.159119    CA
B -0.134841  0.390528  0.166905  0.184502    NY
C  0.807706  0.072960  0.638787  0.329646    WY
D -0.497104 -0.754070 -0.943406  0.484752    OR
E -0.116773  1.901755  0.238127  1.996652    CO

In [56]:
df.set_index("State",inplace = True)

In [57]:
df

              W         X         Y         Z
State
CA     0.302665  1.693723 -1.706086 -1.159119
NY    -0.134841  0.390528  0.166905  0.184502
WY     0.807706  0.072960  0.638787  0.329646
OR    -0.497104 -0.754070 -0.943406  0.484752
CO    -0.116773  1.901755  0.238127  1.996652

 ## Multi-Index and Index hierarchy

In [59]:
import numpy as np
import pandas as pd

In [63]:
# INDEX LEVELS
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [65]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [66]:
df = pd.DataFrame(randn(6,2),index = hier_index,columns=['A','B'])

In [67]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [68]:
df.index.names

FrozenList([None, None])

In [69]:
df.index.names = ['Group','Num']
df

                  A         B
Group Num
G1    1   -0.993263  0.196800
      2   -1.136645  0.000366
      3    1.025984 -0.156598
G2    1   -0.031579  0.649826
      2    2.154846 -0.610259
      3   -0.755325 -0.346419

In [70]:
df.loc["G1"]

            A         B
Num
1   -0.993263  0.196800
2   -1.136645  0.000366
3    1.025984 -0.156598

In [75]:
df.loc["G1"].loc[2]

A   -1.136645
B    0.000366
Name: 2, dtype: float64

In [73]:
df.loc['G1'].iloc[2]

A    1.025984
B   -0.156598
Name: 3, dtype: float64

xs - cross section of dataframe

In [76]:
df.xs('G1')

            A         B
Num
1   -0.993263  0.196800
2   -1.136645  0.000366
3    1.025984 -0.156598

 Works similar to .loc method.<br>
 Useful in cases like - needed 1 from both G1 and G2

In [81]:
df.xs(1,level = 1)

              A         B
Group
G1    -0.993263  0.196800
G2    -0.031579  0.649826

In [82]:
df.xs(1,level="Num")

              A         B
Group
G1    -0.993263  0.196800
G2    -0.031579  0.649826

In [87]:
df.loc[['G1','G2']]

                  A         B
Group Num
G1    1   -0.993263  0.196800
      2   -1.136645  0.000366
      3    1.025984 -0.156598
G2    1   -0.031579  0.649826
      2    2.154846 -0.610259
      3   -0.755325 -0.346419